Autodesk.Navisworks.Api.Point2D
Represents a position in 2D space.

Autodesk.Navisworks.Api.Point2D.#ctor
Create a zero vector
Throws System.InvalidOperationException:
Exception when 'false'

Autodesk.Navisworks.Api.Point2D.#ctor(Autodesk.Navisworks.Api.VariantData)
Create a point from a data object of type Point2D
Throws System.ArgumentNullException:
Argument 'data' is null
Throws System.ArgumentException:
Argument 'data' has been Disposed

Autodesk.Navisworks.Api.Point2D.#ctor(System.Double,System.Double)
Create a point from X and Y components

Autodesk.Navisworks.Api.Point2D.Add(Autodesk.Navisworks.Api.Vector2D)
Translates a point by a vector to produce a new point
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.Point2D.Distance
Distance of point from origin
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Point2D.DistanceSquared
Distance of point from origin squared
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Point2D.DistanceTo(Autodesk.Navisworks.Api.Point2D)
Distance from this point to another point
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'other' is null
Throws System.ArgumentException:
Argument 'other' has been Disposed

Autodesk.Navisworks.Api.Point2D.DistanceToSquared(Autodesk.Navisworks.Api.Point2D)
Distance squared from this point to another point
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'other' is null
Throws System.ArgumentException:
Argument 'other' has been Disposed

Autodesk.Navisworks.Api.Point2D.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.Point2D.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.Point2D.IsOrigin
Is this point at the origin (all components zero) ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Point2D.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Point2D.Item(System.Int32)


Autodesk.Navisworks.Api.Point2D.Origin
Return point at the origin (all components zero)

Autodesk.Navisworks.Api.Point2D.Subtract(Autodesk.Navisworks.Api.Point2D)
Creates a new vector from point to this
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'point' is null
Throws System.ArgumentException:
Argument 'point' has been Disposed

Autodesk.Navisworks.Api.Point2D.Subtract(Autodesk.Navisworks.Api.Vector2D)
Translates a point by a vector to produce a new point
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.Point2D.ToData
Converts point to a data object of type Point3D
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Point2D.TolerantEquals(Autodesk.Navisworks.Api.Point2D)
Compare points using a tolerance
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'point' is null
Throws System.ArgumentException:
Argument 'point' has been Disposed

Autodesk.Navisworks.Api.Point2D.TolerantEquals(Autodesk.Navisworks.Api.Point2D,Autodesk.Navisworks.Api.Point2D)
Compare points using a tolerance
Throws System.ArgumentNullException:
Argument 'point0' is null
Throws System.ArgumentException:
Argument 'point0' has been Disposed
Throws System.ArgumentNullException:
Argument 'point1' is null
Throws System.ArgumentException:
Argument 'point1' has been Disposed

Autodesk.Navisworks.Api.Point2D.TolerantEquals(Autodesk.Navisworks.Api.Point2D,Autodesk.Navisworks.Api.Point2D,System.Double)
Compare points using a tolerance
Throws System.ArgumentNullException:
Argument 'point0' is null
Throws System.ArgumentException:
Argument 'point0' has been Disposed
Throws System.ArgumentNullException:
Argument 'point1' is null
Throws System.ArgumentException:
Argument 'point1' has been Disposed

Autodesk.Navisworks.Api.Point2D.TolerantEquals(Autodesk.Navisworks.Api.Point2D,System.Double)
Compare points using a tolerance
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'point' is null
Throws System.ArgumentException:
Argument 'point' has been Disposed

Autodesk.Navisworks.Api.Point2D.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.Point2D.X
Returns the X component of the point
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Point2D.Y
Returns the Y component of the point
Throws System.ObjectDisposedException:
Object has been Disposed